Desafíos/Loggers, gzip y análisis de perfomance/Resultados de tests/resultados-Artillery.txt
Running scenarios...
Phase started: unnamed (index: 0, duration: 1s) 16:30:09(-0500)

Phase completed: unnamed (index: 0, duration: 1s) 16:30:10(-0500)

--------------------------------------
Metrics for period to: 16:30:10(-0500) (width: 0.674s)
--------------------------------------

http.codes.200: ................................................................ 26
http.request_rate: ............................................................. 39/sec
http.requests: ................................................................. 39
http.response_time:
  min: ......................................................................... 43
  max: ......................................................................... 201
  median: ...................................................................... 135.7
  p95: ......................................................................... 172.5
  p99: ......................................................................... 175.9
http.responses: ................................................................ 26
vusers.created: ................................................................ 14
vusers.created_by_name.0: ...................................................... 14


All VUs finished. Total time: 20 seconds

--------------------------------
Summary report @ 16:30:27(-0500)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 35/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 21
  max: ......................................................................... 317
  median: ...................................................................... 179.5
  p95: ......................................................................... 257.3
  p99: ......................................................................... 284.3
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 11453.3
  max: ......................................................................... 11888.7
  median: ...................................................................... 11734.2
  p95: ......................................................................... 11734.2
  p99: ......................................................................... 11734.2